#Спецификация УВМ

class UVMSpec24:
    # Коды операций
    OP_LOAD = 234  # Загрузка константы
    OP_READ = 102  # Чтение из памяти
    OP_WRITE = 90  # Запись в память
    OP_SHIFT_RIGHT = 224  # Логический сдвиг вправо

    # Тестовые команды из спецификации
    TEST_COMMANDS = {
        "load": {
            "hex": [0xEA, 0x3A, 0x6E],
            "fields": {"A": 234, "B": 2, "C": 455}
        },
        "read": {
            "hex": [0x66, 0xE6, 0xC1, 0x81],
            "fields": {"A": 102, "B": 486, "C": 6, "D": 1}
        },
        "write": {
            "hex": [0x5A, 0x15],
            "fields": {"A": 90, "B": 5, "C": 2}
        },
        "shift": {
            "hex": [0xE0, 0x25, 0x0D, 0x00, 0x44, 0x89, 0x01],
            "fields": {"A": 224, "B": 5, "C": 420, "D": 593, "E": 3}
        }
    }